In [1]:
!conda list | grep pandas

pandas                    1.4.2            py39he9d5cce_0

In [4]:
import pandas as pd

In [3]:
df = pd.read_csv('data/friend_list.csv')

NameError: name 'pd' is not defined

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [7]:
df = pd.read_csv('data/friend_list_tab.txt')

In [8]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [9]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t')

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [12]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [14]:
df.columns = ['name', 'age', 'job']

In [16]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [17]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern